// Homework 01

Console.Clear();
Console.Write("Укажите номер задания (2, 4, 6, 8): ");
int task = int.Parse(Console.ReadLine());

if (task == 2)
{
// Задача 2: -----------------------------------------------------------------------------
// Напишите программу, которая на вход принимает два числа и выдаёт, 
// какое число большее, а какое меньшее.

}
else if (task == 4)
{
// Задача 4: -----------------------------------------------------------------------------
// Напишите программу, которая принимает на вход три числа и 
// выдаёт максимальное из этих чисел.

}
else if (task == 6)
{
// Задача 6: -----------------------------------------------------------------------------
// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным
// (делится ли оно на два без остатка).

}
else if (task == 8)
{
// Задача 8: -----------------------------------------------------------------------------
// Напишите программу, которая на вход принимает число (N),
// а на выходе показывает все чётные числа от 1 до N.

}
else
{
    Console.WriteLine("Выбран неверный номер задания");
}

